#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main()
//{
//	int a = 20;//四个字节--32bit
//	//00000000000000000000000000010100--原码
//	//00000000000000000000000000010100--反码
//	//0000 0000 0000 0000 0000 0000  0001 0100--补码
//	//0x00000014
//	int b = -10;
//	//100000000000000000000000000001010--原码
//	//111111111111111111111111111110101--反码
//	//1111 1111 1111 1111 1111 1111 1111 0110--补码
//	//0xfffffff6
//	return 0;
//}
//*********************************************
//设计一个小程序，判断机器的字节序
//大端存储--数据的低位存储在高地址，高位存储在低地址
//小端存储--数据的低位存储在低地址，高位存储在高地址
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端存储");
//	}
//	else
//	{
//		printf("大端存储");
//	}
//	return 0;
//}
int check_sys()
{
    int a = 1;
	return *(char*)&a;
	//返回1，小端
    //返回0，大端
}
int main()
{
	//设计一个小程序，判断机器的字节序
	//返回1，小端
	//返回0，大端
	int ret = check_sys();
	if (ret == 1)
		{
			printf("小端存储");
		}
	else
		{
			printf("大端存储");
		}
	return 0;
}