#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main()
//{
//	int a = 20;//四个字节--32bit
//	//00000000000000000000000000010100--原码
//	//00000000000000000000000000010100--反码
//	//0000 0000 0000 0000 0000 0000  0001 0100--补码
//	//0x00000014
//	int b = -10;
//	//100000000000000000000000000001010--原码
//	//111111111111111111111111111110101--反码
//	//1111 1111 1111 1111 1111 1111 1111 0110--补码
//	//0xfffffff6
//	return 0;
//}
//*********************************************
//设计一个小程序，判断机器的字节序
//大端存储--数据的低位存储在高地址，高位存储在低地址
//小端存储--数据的低位存储在低地址，高位存储在高地址
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端存储");
//	}
//	else
//	{
//		printf("大端存储");
//	}
//	return 0;
//}
//int check_sys()
//{
//    int a = 1;
//	return *(char*)&a;
//	//返回1，小端
//    //返回0，大端
//}
//int main()
//{
//	//设计一个小程序，判断机器的字节序
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//		{
//			printf("小端存储");
//		}
//	else
//		{
//			printf("大端存储");
//		}
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//	//整型提升--
//	//11111111111111111111111111111111
//	signed char b = -1;
//	//11111111
//	//整型提升--
//	//11111111111111111111111111111111
//	unsigned char c = -1;
//	//11111111
//    //整型提升--
//	//00000000000000000000000011111111
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//    //11111111111111111111111101111111
//	//11111111111111111111111110000000
//	//10000000
//	//整型提升--
//	//11111111111111111111111110000000--4294967168
//	printf("%u\n", a);//%d打印十进制的有符号数字--%u打印十进制的无符号数字
//	return 0;
//}

int main()
{
	int i = -20;
	unsigned int j = 10;
	printf("%d\n", i + j);
	return 0;
}